 
//=================================================================================================
//                    НАЧАЛО СЧИТЫВАНИЯ ПОКАЗАНИЙ С DS18B20.

int t2()
   {

byte data[2];
ds.reset(); 
ds.write(0xCC);
ds.write(0x44);
ds.reset();
ds.write(0xCC);
ds.write(0xBE);
data[0] = ds.read(); 
data[1] = ds.read();
int Temp = (data[1]<< 8)+data[0];
Temp = Temp>>4;
return Temp;

     
   }
//                    КОНЕЦ СЧИТЫВАНИЯ ПОКАЗАНИЙ С DS18B20.
//================================================================================================= 

//=================================================================================================
//                    НАЧАЛО СЧИТЫВАНИЯ ПОКАЗАНИЙ с Терморезисторов NTC 100ком.
//                    КОНЕЦ СЧИТЫВАНИЯ ПОКАЗАНИЙ с Терморезисторов NTC 100ком.
//================================================================================================= 
